import { News } from '../types';

export const frostpunk2News: News = {
  id: 'frostpunk-2',
  title: 'Frostpunk 2 получила дату релиза и новый трейлер',
  excerpt: `Ух, 11 bit studios снова выпускают игру в моём любимом жанре «цейтнот». Снова везде не хватает рук, ресурсов, нервов у жителей базы и у игрока самого. Но до чего же кайфово!...`,
  content: `Ух, 11 bit studios снова выпускают игру в моём любимом жанре «цейтнот». Снова везде не хватает рук, ресурсов, нервов у жителей базы и у игрока самого. Но до чего же кайфово! Лет десять назад, когда в Steam каждый день выходил очередной выживач в раннем доступе, я всё никак не мог найти тот самый проект, который закроет все мои хотелки. Но сейчас, похоже, можно уже сказать, что лично для меня он уже вышел.

Конечно, это развитие механик Frostpunk, но с упором на конкретных персонажей. Да, и раньше были эвенты с разными «именными» героями, но теперь у NPC столько общего с главным героем, что крики в экран «этот чел буквально я» неизбежны.

Пока что всё нравится, но я бы сделал систему управления базой одной мышкой, а не на своих двоих — уж слишком часто приходится переставлять комнаты для уюта и эргономики. В остальном — очередной претендент на награды в конце года! Буду продолжать играть, обновлю отзыв ближе к концу игры.`,
  author: 'Иван Иванов',
  date: '15 октября 2024',
  image: 'https://i.playground.ru/e/HKgufX4DkpnjKOUDsrSA7A.jpeg',
  tags: ['стратегия', '11 bit studios', 'постапокалипсис'],
};